# Part 1

The file "Purchase_Data.csv" contains purchase data at a Chinese supermarket for various products.  Read this csv into a dataframe called df_data and use the head() method to check that you have read in the data correctly. Make sure you import pandas.

In [3]:
pip install pandas

Collecting pandasNote: you may need to restart the kernel to use updated packages.

  Downloading pandas-2.2.3-cp312-cp312-win_amd64.whl.metadata (19 kB)
Collecting numpy>=1.26.0 (from pandas)
  Downloading numpy-2.2.2-cp312-cp312-win_amd64.whl.metadata (60 kB)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\dellg15\anaconda3\envs\notebook\lib\site-packages (from pandas) (2.9.0.post0)
Collecting pytz>=2020.1 (from pandas)
  Using cached pytz-2024.2-py2.py3-none-any.whl.metadata (22 kB)
Collecting tzdata>=2022.7 (from pandas)
  Using cached tzdata-2025.1-py2.py3-none-any.whl.metadata (1.4 kB)
Requirement already satisfied: six>=1.5 in c:\users\dellg15\anaconda3\envs\notebook\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Downloading pandas-2.2.3-cp312-cp312-win_amd64.whl (11.5 MB)
   ---------------------------------------- 0.0/11.5 MB ? eta -:--:--
   - -------------------------------------- 0.5/11.5 MB 4.2 MB/s eta 0:00:03
   ---- ----------------------------------- 1.3/11.5 MB 4.0 MB/s eta 0:00:03
   ------ --------------------------------- 1.8/11.5 MB 4.0 MB/s eta 0:00:03
   ---------- ----------------------------- 2.9/11.5 MB 3.7 MB/s eta 0:00:03
   ------------ --------------------------- 3.7/11.5 MB 3.8 MB/s eta 0:00:03
   --------------- ------------------------ 4.5/11.5 MB 3.8 MB/s eta 0:00:02
   ------------------ --------------------- 5.2/11.5 MB 3.8 MB/s eta 0:00:02
   -------------------- ------------------- 5.8/11.5 MB 3.8 MB/s eta 0:00:02
   -------------------- ------------------- 6.0/11.5 MB 3.7 MB/s eta 0:00:02
   --------------------- ------------------ 6.3/11.5 MB 3.2 MB/s eta 0:00:02
   ----------------------- ---------------- 6.8/11.5 MB 3.1 MB/s eta 0:00:02
   -------------------------- ------------- 7.6/11.5 MB 3.2 MB/s eta 0:00:02
   ----------------------------- ---------- 8.4/11.5 MB 3.3 MB/s eta 0:00:01
   ------------------------------- -------- 9.2/11.5 MB 3.3 MB/s eta 0:00:01
   ---------------------------------- ----- 10.0/11.5 MB 3.4 MB/s eta 0:00:01
   ------------------------------------- -- 10.7/11.5 MB 3.4 MB/s eta 0:00:01
   ---------------------------------------  11.3/11.5 MB 3.4 MB/s eta 0:00:01
   ---------------------------------------- 11.5/11.5 MB 3.4 MB/s eta 0:00:00
Downloading numpy-2.2.2-cp312-cp312-win_amd64.whl (12.6 MB)
   ---------------------------------------- 0.0/12.6 MB ? eta -:--:--
   - -------------------------------------- 0.5/12.6 MB 3.4 MB/s eta 0:00:04
   ---- ----------------------------------- 1.3/12.6 MB 3.5 MB/s eta 0:00:04
   ------ --------------------------------- 2.1/12.6 MB 3.6 MB/s eta 0:00:03
   -------- ------------------------------- 2.6/12.6 MB 3.6 MB/s eta 0:00:03
   ---------- ----------------------------- 3.4/12.6 MB 3.6 MB/s eta 0:00:03
   ------------- -------------------------- 4.2/12.6 MB 3.6 MB/s eta 0:00:03
   --------------- ------------------------ 5.0/12.6 MB 3.6 MB/s eta 0:00:03
   ------------------ --------------------- 5.8/12.6 MB 3.6 MB/s eta 0:00:02
   ------------------- -------------------- 6.3/12.6 MB 3.6 MB/s eta 0:00:02
   ---------------------- ----------------- 7.1/12.6 MB 3.6 MB/s eta 0:00:02
   ------------------------ --------------- 7.9/12.6 MB 3.6 MB/s eta 0:00:02
   -------------------------- ------------- 8.4/12.6 MB 3.6 MB/s eta 0:00:02
   ---------------------------- ----------- 8.9/12.6 MB 3.5 MB/s eta 0:00:02
   ------------------------------ --------- 9.7/12.6 MB 3.5 MB/s eta 0:00:01
   -------------------------------- ------- 10.2/12.6 MB 3.5 MB/s eta 0:00:01
   ---------------------------------- ----- 11.0/12.6 MB 3.5 MB/s eta 0:00:01
   ------------------------------------- -- 11.8/12.6 MB 3.5 MB/s eta 0:00:01
   ---------------------------------------  12.6/12.6 MB 3.5 MB/s eta 0:00:01
   ---------------------------------------- 12.6/12.6 MB 3.5 MB/s eta 0:00:00
Using cached pytz-2024.2-py2.py3-none-any.whl (508 kB)
Using cached tzdata-2025.1-py2.py3-none-any.whl (346 kB)
Installing collected packages: pytz, tzdata, numpy, pandas
Successfully installed numpy-2.2.2 pandas-2.2.3 pytz-2024.2 tzdata-2025.1

In [50]:
#Write your code here
import pandas as pd 
df_data = pd.read_csv("Data/Purchase_Data.csv")
df_data.head()

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price
0,2.020000e+11,7/15/15 10:45,G816,7000300,210101,1.0,2.0
1,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0
2,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0
3,2.020000e+11,7/15/15 12:16,G816,7070891,70401,1.0,6.0
4,2.020000e+11,7/15/15 12:16,G816,7090363,70401,1.0,6.0

Use the dtypes attribute to view how each column is stored

In [51]:
#Write your code here
df_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5382 entries, 0 to 5381
Data columns (total 7 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   invoice_number  5382 non-null   float64
 1   invoice_time    5382 non-null   object
 2   store_id        5382 non-null   object
 3   product_id      5382 non-null   int64
 4   category_id     5382 non-null   int64
 5   num_item        5382 non-null   float64
 6   price           5382 non-null   float64
dtypes: float64(3), int64(2), object(2)
memory usage: 294.5+ KB

Slice the first two columns using .loc and store the result in a variable called result_1.

In [52]:
#Write you code here
result_1 = df_data.loc[ : ,["invoice_number" , "invoice_time"]]
result_1

      invoice_number   invoice_time
0       2.020000e+11  7/15/15 10:45
1       2.020000e+11  7/15/15 12:16
2       2.020000e+11  7/15/15 12:16
3       2.020000e+11  7/15/15 12:16
4       2.020000e+11  7/15/15 12:16
...              ...            ...
5377    2.020000e+11   9/5/15 23:07
5378    2.020000e+11   9/5/15 23:23
5379    2.020000e+11   9/5/15 23:24
5380    2.020000e+11   9/5/15 23:32
5381    2.020000e+11   9/5/15 23:38

[5382 rows x 2 columns]

Slice the first two rows using .loc and store the result in a variable called result_2.

In [53]:
#Write you code here
result_2 = df_data.loc[ 0 : 1 ]
result_2

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price
0,2.020000e+11,7/15/15 10:45,G816,7000300,210101,1.0,2.0
1,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0

Slice the first four rows and the first five columns and store the result in a variable called result_3.

In [54]:
#Write your code here
result_3 = df_data.iloc[ :4 , :5]
result_3

   invoice_number   invoice_time store_id  product_id  category_id
0    2.020000e+11  7/15/15 10:45     G816     7000300       210101
1    2.020000e+11  7/15/15 12:16     G816     7070884        70203
2    2.020000e+11  7/15/15 12:16     G816     7070884        70203
3    2.020000e+11  7/15/15 12:16     G816     7070891        70401

Slice rows 0,4,6 and columns invoice time and price and store the result in variable called result_4.

In [55]:
#Write your code here
result_4 = df_data.loc[ [0 ,4, 6], [ "invoice_time" , "price"]]
result_4

    invoice_time  price
0  7/15/15 10:45    2.0
4  7/15/15 12:16    6.0
6  7/15/15 15:28    2.0

Store the number rows in a variable called num_rows.

In [56]:
num_rows = df_data.shape[0]
num_rows

5382

Print out the last row of the data to dataframe. **Hint:** use the variable num_rows from the previous exercise.

In [57]:
#Write your code here
df = df_data.iloc[-1: , : ]
df

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price
5381,2.020000e+11,9/5/15 23:38,G619,23030206,210101,1.0,2.0

# Part 2

Compute the average and max price charged.  Store the results in variables called avg_price and max_price

In [58]:
#Write your code here
avg_price = df_data["price"].mean()
max_price = df_data["price"].max()
avg_price,max_price

(np.float64(3.1920522110741363), np.float64(6.01))

Compute the average price and average number of items purchased with only a single call to the mean() method. Store these averages in avg_price and avg_num_items.

In [59]:
#Write you code here
averages = df_data[["price", "num_item"]].mean()
avg_price = averages["price"]
avg_num_items = averages["num_item"]
avg_price, avg_num_items

(np.float64(3.1920522110741363), np.float64(1.2983091787439613))

Create a column called "total", which is the product of the price and num_item columns.

In [60]:
df_data

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price
0,2.020000e+11,7/15/15 10:45,G816,7000300,210101,1.0,2.0
1,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0
2,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0
3,2.020000e+11,7/15/15 12:16,G816,7070891,70401,1.0,6.0
4,2.020000e+11,7/15/15 12:16,G816,7090363,70401,1.0,6.0
...,...,...,...,...,...,...,...
5377,2.020000e+11,9/5/15 23:07,300,7308017,210101,1.0,3.0
5378,2.020000e+11,9/5/15 23:23,G619,7070891,70401,1.0,6.0
5379,2.020000e+11,9/5/15 23:24,G619,7071096,70201,1.0,5.0
5380,2.020000e+11,9/5/15 23:32,G619,15000231,70301,2.0,2.0
5381,2.020000e+11,9/5/15 23:38,G619,23030206,210101,1.0,2.0

In [63]:
#Write your code here
df_data["total"] = df_data["price"] + df_data["num_item"]
df_data

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price,total
0,2.020000e+11,7/15/15 10:45,G816,7000300,210101,1.0,2.0,3.0
1,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0,3.0
2,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0,3.0
3,2.020000e+11,7/15/15 12:16,G816,7070891,70401,1.0,6.0,7.0
4,2.020000e+11,7/15/15 12:16,G816,7090363,70401,1.0,6.0,7.0
...,...,...,...,...,...,...,...,...
5377,2.020000e+11,9/5/15 23:07,300,7308017,210101,1.0,3.0,4.0
5378,2.020000e+11,9/5/15 23:23,G619,7070891,70401,1.0,6.0,7.0
5379,2.020000e+11,9/5/15 23:24,G619,7071096,70201,1.0,5.0,6.0
5380,2.020000e+11,9/5/15 23:32,G619,15000231,70301,2.0,2.0,4.0
5381,2.020000e+11,9/5/15 23:38,G619,23030206,210101,1.0,2.0,3.0

What is the avgerage price of the three most expensive purchases?

In [67]:
#Write your code here
average_top3 = df_data.nlargest(3, "price")["price"].mean()
average_top3

np.float64(6.003333333333333)

How many different products are there?

In [77]:
#Write your code here

num_products = df_data["num_item"].nunique()
num_products

15

Find the difference between the mean and median of the column total.  Use the describe() method and then index the dataframe it returns.

In [80]:
#Write your code here
stats = df_data["total"].describe()
mean_median_difference = stats["mean"] - stats["50%"]
stats,mean_median_difference

(count    5382.000000
 mean        4.490361
 std         2.647166
 min         1.000000
 25%         3.000000
 50%         4.000000
 75%         6.000000
 max       119.000000
 Name: total, dtype: float64,
 np.float64(0.49036138981809785))

Use the drop() method to delete the column total from the dataframe df_data.

In [82]:
df_data

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price,total
0,2.020000e+11,7/15/15 10:45,G816,7000300,210101,1.0,2.0,3.0
1,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0,3.0
2,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0,3.0
3,2.020000e+11,7/15/15 12:16,G816,7070891,70401,1.0,6.0,7.0
4,2.020000e+11,7/15/15 12:16,G816,7090363,70401,1.0,6.0,7.0
...,...,...,...,...,...,...,...,...
5377,2.020000e+11,9/5/15 23:07,300,7308017,210101,1.0,3.0,4.0
5378,2.020000e+11,9/5/15 23:23,G619,7070891,70401,1.0,6.0,7.0
5379,2.020000e+11,9/5/15 23:24,G619,7071096,70201,1.0,5.0,6.0
5380,2.020000e+11,9/5/15 23:32,G619,15000231,70301,2.0,2.0,4.0
5381,2.020000e+11,9/5/15 23:38,G619,23030206,210101,1.0,2.0,3.0

In [90]:
#Write your code here
df_data = df_data.drop(["total"] , axis = 1 )
df_data

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price
0,2.020000e+11,7/15/15 10:45,G816,7000300,210101,1.0,2.0
1,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0
2,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0
3,2.020000e+11,7/15/15 12:16,G816,7070891,70401,1.0,6.0
4,2.020000e+11,7/15/15 12:16,G816,7090363,70401,1.0,6.0
...,...,...,...,...,...,...,...
5377,2.020000e+11,9/5/15 23:07,300,7308017,210101,1.0,3.0
5378,2.020000e+11,9/5/15 23:23,G619,7070891,70401,1.0,6.0
5379,2.020000e+11,9/5/15 23:24,G619,7071096,70201,1.0,5.0
5380,2.020000e+11,9/5/15 23:32,G619,15000231,70301,2.0,2.0
5381,2.020000e+11,9/5/15 23:38,G619,23030206,210101,1.0,2.0

Let's dig a little deeper into the data set and answer some basic question.

First, covert the column invoice time to a datetime column. Print out the new column types to make sure this was done correctly

In [91]:
#Write your code here
df_data["invoice_time"] = pd.to_datetime(df_data["invoice_time"])
print(df_data.dtypes)

C:\Users\dellg15\AppData\Local\Temp\ipykernel_21788\3376125209.py:2: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  df_data["invoice_time"] = pd.to_datetime(df_data["invoice_time"])

invoice_number           float64
invoice_time      datetime64[ns]
store_id                  object
product_id                 int64
category_id                int64
num_item                 float64
price                    float64
dtype: object

Next, let's create columns called "DOW" and "Month", which store the corresponding weekday and month of the invoice respectively.  Print the head of the dataframe to make sure this was done correctly.

In [103]:
#Write your code here

df_data["DOW"] = df_data["invoice_time"].apply(lambda x: x.strftime('%A'))  
df_data["Month"] = df_data["invoice_time"].apply(lambda x: x.strftime('%B'))  
df_data

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price,DOW,Month
0,2.020000e+11,2015-07-15 10:45:00,G816,7000300,210101,1.0,2.0,Wednesday,July
1,2.020000e+11,2015-07-15 12:16:00,G816,7070884,70203,1.0,2.0,Wednesday,July
2,2.020000e+11,2015-07-15 12:16:00,G816,7070884,70203,1.0,2.0,Wednesday,July
3,2.020000e+11,2015-07-15 12:16:00,G816,7070891,70401,1.0,6.0,Wednesday,July
4,2.020000e+11,2015-07-15 12:16:00,G816,7090363,70401,1.0,6.0,Wednesday,July
...,...,...,...,...,...,...,...,...,...
5377,2.020000e+11,2015-09-05 23:07:00,300,7308017,210101,1.0,3.0,Saturday,September
5378,2.020000e+11,2015-09-05 23:23:00,G619,7070891,70401,1.0,6.0,Saturday,September
5379,2.020000e+11,2015-09-05 23:24:00,G619,7071096,70201,1.0,5.0,Saturday,September
5380,2.020000e+11,2015-09-05 23:32:00,G619,15000231,70301,2.0,2.0,Saturday,September
5381,2.020000e+11,2015-09-05 23:38:00,G619,23030206,210101,1.0,2.0,Saturday,September

Create a variable called num_purchases_wed, which stores the number of purchases made on Wednesday?  You should use value_counts and then index the series it return.

In [113]:
#Write your code here
df_data["DOW"].value_counts()[0]

C:\Users\dellg15\AppData\Local\Temp\ipykernel_21788\4106211898.py:2: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df_data["DOW"].value_counts()[0]

np.int64(959)

# Part 3

In this set of practice exercises, we will be working with a demographic data regarding the passengers aboard the Titanic.  Read in the data frame and use the head() method to check that it was read in correctly.

In [116]:
#Write your code here
data = pd.read_csv("Data/Titanic.csv")
data.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

Use the rename method to change the column "Name" to "Passenger_Name" and the column "Ticket" to "Ticket_Num".

In [119]:
#Write your code here
data.rename(columns={"Passenger_Name": "Name"}, inplace=True)

Change the index of the df_titanic to the column PasengerID.

In [123]:
#Write your code here
data.set_index("PassengerId", inplace=True)

KeyError: "None of ['PassengerId'] are in the columns"

In [124]:
data

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,
892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
...,...,...,...,...,...,...,...,...,...,...
1305,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
1306,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
1307,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
1308,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
1309,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

Select the name of passenger 896

In [126]:
#Write your code here
name = data.loc[896, "Name"]
name

'Hirvonen, Mrs. Alexander (Helga E Lindqvist)'

Change the index back to row numbers but making sure that we don't lose the PassengerId column.

In [127]:
#Write your code here
data.reset_index(drop=False, inplace=True)
data

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
413,1305,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
414,1306,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
415,1307,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
417,1309,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

How many missing entries are there in the Age column? Use the isnull() method and recall than Booleans are exactly like 1s (True) and 0s (False).

In [129]:
#Write you code here
missing_age = data["Age"].isnull().sum()
missing_age

np.int64(86)

Compute the avg age of passengers ignoring the missing data.

In [131]:
#Write your code here
avg_age = data["Age"].dropna().mean()
avg_age

np.float64(30.272590361445783)

Using the fillna() method replace the missing values in the Age column with the mean.

In [135]:
#Write your code here
mean_age = data["Age"].mean()
data["Age"] = data["Age"].fillna(mean_age)
mean_age

np.float64(30.272590361445783)

What is the average age of the 5 oldest passengers? The reset_index method will be helpful here.

In [134]:
#Write your code here
top5_oldest = data.sort_values(by="Age", ascending=False).head(5)
average_age_top5 = top5_oldest["Age"].mean()
average_age_top5

np.float64(67.0)